Teste/Connected Services/MCWFU/g5-senior-services.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://services.senior.com.br" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="g5-senior-services" targetNamespace="http://services.senior.com.br" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="http://localhost:8080/g5-senior-services/rubi_AsyncMCWFUsers?xsd=1" namespace="http://services.senior.com.br" />
    </xsd:schema>
  </types>
  <message name="DiscoverUsersGroups">
    <part name="user" type="xsd:string" />
    <part name="password" type="xsd:string" />
    <part name="encryption" type="xsd:int" />
    <part name="parameters" type="tns:mcwfUsersDiscoverUsersGroupsIn" />
  </message>
  <message name="DiscoverUsersGroupsResponse">
    <part name="result" type="xsd:string" />
  </message>
  <message name="PersonExists">
    <part name="user" type="xsd:string" />
    <part name="password" type="xsd:string" />
    <part name="encryption" type="xsd:int" />
    <part name="parameters" type="tns:mcwfUsersPersonExistsIn" />
  </message>
  <message name="PersonExistsResponse">
    <part name="result" type="xsd:string" />
  </message>
  <message name="GetUserGroups">
    <part name="user" type="xsd:string" />
    <part name="password" type="xsd:string" />
    <part name="encryption" type="xsd:int" />
    <part name="parameters" type="tns:mcwfUsersGetUserGroupsIn" />
  </message>
  <message name="GetUserGroupsResponse">
    <part name="result" type="xsd:string" />
  </message>
  <message name="GetPersonKind">
    <part name="user" type="xsd:string" />
    <part name="password" type="xsd:string" />
    <part name="encryption" type="xsd:int" />
    <part name="parameters" type="tns:mcwfUsersGetPersonKindIn" />
  </message>
  <message name="GetPersonKindResponse">
    <part name="result" type="xsd:string" />
  </message>
  <message name="UserReplication">
    <part name="user" type="xsd:string" />
    <part name="password" type="xsd:string" />
    <part name="encryption" type="xsd:int" />
    <part name="parameters" type="tns:mcwfUsersUserReplicationIn" />
  </message>
  <message name="UserReplicationResponse">
    <part name="result" type="xsd:string" />
  </message>
  <message name="ChangePassword">
    <part name="user" type="xsd:string" />
    <part name="password" type="xsd:string" />
    <part name="encryption" type="xsd:int" />
    <part name="parameters" type="tns:mcwfUsersChangePasswordIn" />
  </message>
  <message name="ChangePasswordResponse">
    <part name="result" type="xsd:string" />
  </message>
  <message name="AuthenticateJAAS">
    <part name="user" type="xsd:string" />
    <part name="password" type="xsd:string" />
    <part name="encryption" type="xsd:int" />
    <part name="parameters" type="tns:mcwfUsersAuthenticateJAASIn" />
  </message>
  <message name="AuthenticateJAASResponse">
    <part name="result" type="xsd:string" />
  </message>
  <portType name="rubi_AsyncMCWFUsers">
    <operation name="DiscoverUsersGroups" parameterOrder="user password encryption parameters">
      <input wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/DiscoverUsersGroupsRequest" message="tns:DiscoverUsersGroups" />
      <output wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/DiscoverUsersGroupsResponse" message="tns:DiscoverUsersGroupsResponse" />
    </operation>
    <operation name="PersonExists" parameterOrder="user password encryption parameters">
      <input wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/PersonExistsRequest" message="tns:PersonExists" />
      <output wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/PersonExistsResponse" message="tns:PersonExistsResponse" />
    </operation>
    <operation name="GetUserGroups" parameterOrder="user password encryption parameters">
      <input wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/GetUserGroupsRequest" message="tns:GetUserGroups" />
      <output wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/GetUserGroupsResponse" message="tns:GetUserGroupsResponse" />
    </operation>
    <operation name="GetPersonKind" parameterOrder="user password encryption parameters">
      <input wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/GetPersonKindRequest" message="tns:GetPersonKind" />
      <output wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/GetPersonKindResponse" message="tns:GetPersonKindResponse" />
    </operation>
    <operation name="UserReplication" parameterOrder="user password encryption parameters">
      <input wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/UserReplicationRequest" message="tns:UserReplication" />
      <output wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/UserReplicationResponse" message="tns:UserReplicationResponse" />
    </operation>
    <operation name="ChangePassword" parameterOrder="user password encryption parameters">
      <input wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/ChangePasswordRequest" message="tns:ChangePassword" />
      <output wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/ChangePasswordResponse" message="tns:ChangePasswordResponse" />
    </operation>
    <operation name="AuthenticateJAAS" parameterOrder="user password encryption parameters">
      <input wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/AuthenticateJAASRequest" message="tns:AuthenticateJAAS" />
      <output wsam:Action="http://services.senior.com.br/rubi_AsyncMCWFUsers/AuthenticateJAASResponse" message="tns:AuthenticateJAASResponse" />
    </operation>
  </portType>
  <binding name="rubi_AsyncMCWFUsersPortBinding" type="tns:rubi_AsyncMCWFUsers">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <operation name="DiscoverUsersGroups">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </input>
      <output>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </output>
    </operation>
    <operation name="PersonExists">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </input>
      <output>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </output>
    </operation>
    <operation name="GetUserGroups">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </input>
      <output>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </output>
    </operation>
    <operation name="GetPersonKind">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </input>
      <output>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </output>
    </operation>
    <operation name="UserReplication">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </input>
      <output>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </output>
    </operation>
    <operation name="ChangePassword">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </input>
      <output>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </output>
    </operation>
    <operation name="AuthenticateJAAS">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </input>
      <output>
        <soap:body use="literal" namespace="http://services.senior.com.br" />
      </output>
    </operation>
  </binding>
  <service name="g5-senior-services">
    <port name="rubi_AsyncMCWFUsersPort" binding="tns:rubi_AsyncMCWFUsersPortBinding">
      <soap:address location="http://localhost:8080/g5-senior-services/rubi_AsyncMCWFUsers" />
    </port>
  </service>
</definitions>